## Plan Result (1112: sbox_aria - Terraform Plan Apply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 74 to add, 7 to change, 18 to destroy.</code></pre>

* Create
  * azurerm_eventhub.aria_topic[&#34;00-aplfpa-ack&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-aplfpa-dl&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-aplfpa-pub&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-aplfta-ack&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-aplfta-dl&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-aplfta-pub&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-apluta-ack&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-apluta-dl&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-apluta-pub&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-sbl-ack&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-sbl-dl&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-sbl-pub&#34;]
  * azurerm_eventhub.aria_topic[&#34;02-aplfpa-ack&#34;]
  * azurerm_eventhub.aria_topic[&#34;02-aplfpa-dl&#34;]
  * azurerm_eventhub.aria_topic[&#34;02-aplfpa-pub&#34;]
  * azurerm_eventhub.aria_topic[&#34;02-aplfta-ack&#34;]
  * azurerm_eventhub.aria_topic[&#34;02-aplfta-dl&#34;]
  * azurerm_eventhub.aria_topic[&#34;02-aplfta-pub&#34;]
  * azurerm_eventhub.aria_topic[&#34;02-apluta-ack&#34;]
  * azurerm_eventhub.aria_topic[&#34;02-apluta-dl&#34;]
  * azurerm_eventhub.aria_topic[&#34;02-apluta-pub&#34;]
  * azurerm_eventhub.aria_topic[&#34;02-sbl-ack&#34;]
  * azurerm_eventhub.aria_topic[&#34;02-sbl-dl&#34;]
  * azurerm_eventhub.aria_topic[&#34;02-sbl-pub&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-aplfpa-ack&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-aplfpa-dl&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-aplfpa-pub&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-aplfta-ack&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-aplfta-dl&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-aplfta-pub&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-apluta-ack&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-apluta-dl&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-apluta-pub&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-sbl-ack&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-sbl-dl&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-sbl-pub&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;02-aplfpa-ack&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;02-aplfpa-dl&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;02-aplfpa-pub&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;02-aplfta-ack&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;02-aplfta-dl&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;02-aplfta-pub&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;02-apluta-ack&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;02-apluta-dl&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;02-apluta-pub&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;02-sbl-ack&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;02-sbl-dl&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;02-sbl-pub&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;00-aplfpa-ack&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;00-aplfpa-dl&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;00-aplfpa-pub&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;00-aplfta-ack&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;00-aplfta-dl&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;00-aplfta-pub&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;00-apluta-ack&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;00-apluta-dl&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;00-apluta-pub&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;00-sbl-ack&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;00-sbl-dl&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;00-sbl-pub&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;02-aplfpa-ack&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;02-aplfpa-dl&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;02-aplfpa-pub&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;02-aplfta-ack&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;02-aplfta-dl&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;02-aplfta-pub&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;02-apluta-ack&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;02-apluta-dl&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;02-apluta-pub&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;02-sbl-ack&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;02-sbl-dl&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;02-sbl-pub&#34;]
  * azurerm_storage_container.landing[&#34;02-html-template&#34;]
  * azurerm_storage_container.landing[&#34;02-landing&#34;]
* Update
  * azurerm_linux_function_app.example[&#34;02-af-apflpa&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-apl&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-apluta&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-bails&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-joh&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-sbails&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-td&#34;]
* Delete
  * azurerm_eventhub.aria_topic[&#34;00-ap-ack&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-ap-dl&#34;]
  * azurerm_eventhub.aria_topic[&#34;00-ap-pub&#34;]
  * azurerm_eventhub.aria_topic[&#34;02-ap-ack&#34;]
  * azurerm_eventhub.aria_topic[&#34;02-ap-dl&#34;]
  * azurerm_eventhub.aria_topic[&#34;02-ap-pub&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-ap-ack&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-ap-dl&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;00-ap-pub&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;02-ap-ack&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;02-ap-dl&#34;]
  * azurerm_eventhub_authorization_rule.aria_topic_sas[&#34;02-ap-pub&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;00-ap-ack&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;00-ap-dl&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;00-ap-pub&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;02-ap-ack&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;02-ap-dl&#34;]
  * azurerm_key_vault_secret.eventhub_topic_secrets[&#34;02-ap-pub&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_eventhub.aria_topic["00-ap-ack"] will be destroyed
  # (because key ["00-ap-ack"] is not in for_each map)
  - resource "azurerm_eventhub" "aria_topic" {
      - id                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-sbox/eventhubs/evh-ap-ack-00-uks-dlrm-01" -> null
      - message_retention   = 1 -> null
      - name                = "evh-ap-ack-00-uks-dlrm-01" -> null
      - namespace_id        = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-sbox" -> null
      - namespace_name      = "ingest00-integration-eventHubNamespace001-sbox" -> null
      - partition_count     = 2 -> null
      - partition_ids       = [
          - "0",
          - "1",
        ] -> null
      - resource_group_name = "ingest00-main-sbox" -> null
      - status              = "Active" -> null
    }

  # azurerm_eventhub.aria_topic["00-ap-dl"] will be destroyed
  # (because key ["00-ap-dl"] is not in for_each map)
  - resource "azurerm_eventhub" "aria_topic" {
      - id                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-sbox/eventhubs/evh-ap-dl-00-uks-dlrm-01" -> null
      - message_retention   = 1 -> null
      - name                = "evh-ap-dl-00-uks-dlrm-01" -> null
      - namespace_id        = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-sbox" -> null
      - namespace_name      = "ingest00-integration-eventHubNamespace001-sbox" -> null
      - partition_count     = 2 -> null
      - partition_ids       = [
          - "0",
          - "1",
        ] -> null
      - resource_group_name = "ingest00-main-sbox" -> null
      - status              = "Active" -> null
    }

  # azurerm_eventhub.aria_topic["00-ap-pub"] will be destroyed
  # (because key ["00-ap-pub"] is not in for_each map)
  - resource "azurerm_eventhub" "aria_topic" {
      - id                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-sbox/eventhubs/evh-ap-pub-00-uks-dlrm-01" -> null
      - message_retention   = 1 -> null
      - name                = "evh-ap-pub-00-uks-dlrm-01" -> null
      - namespace_id        = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-sbox" -> null
      - namespace_name      = "ingest00-integration-eventHubNamespace001-sbox" -> null
      - partition_count     = 2 -> null
      - partition_ids       = [
          - "0",
          - "1",
        ] -> null
      - resource_group_name = "ingest00-main-sbox" -> null
      - status              = "Active" -> null
    }

  # azurerm_eventhub.aria_topic["00-aplfpa-ack"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-aplfpa-ack-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-aplfpa-dl"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-aplfpa-dl-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-aplfpa-pub"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-aplfpa-pub-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-aplfta-ack"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-aplfta-ack-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-aplfta-dl"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-aplfta-dl-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-aplfta-pub"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-aplfta-pub-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-apluta-ack"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-apluta-ack-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-apluta-dl"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-apluta-dl-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-apluta-pub"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-apluta-pub-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-sbl-ack"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-sbl-ack-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-sbl-dl"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-sbl-dl-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["00-sbl-pub"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-sbl-pub-00-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest00-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest00-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["02-ap-ack"] will be destroyed
  # (because key ["02-ap-ack"] is not in for_each map)
  - resource "azurerm_eventhub" "aria_topic" {
      - id                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.EventHub/namespaces/ingest02-integration-eventHubNamespace001-sbox/eventhubs/evh-ap-ack-02-uks-dlrm-01" -> null
      - message_retention   = 1 -> null
      - name                = "evh-ap-ack-02-uks-dlrm-01" -> null
      - namespace_id        = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.EventHub/namespaces/ingest02-integration-eventHubNamespace001-sbox" -> null
      - namespace_name      = "ingest02-integration-eventHubNamespace001-sbox" -> null
      - partition_count     = 2 -> null
      - partition_ids       = [
          - "0",
          - "1",
        ] -> null
      - resource_group_name = "ingest02-main-sbox" -> null
      - status              = "Active" -> null
    }

  # azurerm_eventhub.aria_topic["02-ap-dl"] will be destroyed
  # (because key ["02-ap-dl"] is not in for_each map)
  - resource "azurerm_eventhub" "aria_topic" {
      - id                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.EventHub/namespaces/ingest02-integration-eventHubNamespace001-sbox/eventhubs/evh-ap-dl-02-uks-dlrm-01" -> null
      - message_retention   = 1 -> null
      - name                = "evh-ap-dl-02-uks-dlrm-01" -> null
      - namespace_id        = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.EventHub/namespaces/ingest02-integration-eventHubNamespace001-sbox" -> null
      - namespace_name      = "ingest02-integration-eventHubNamespace001-sbox" -> null
      - partition_count     = 2 -> null
      - partition_ids       = [
          - "0",
          - "1",
        ] -> null
      - resource_group_name = "ingest02-main-sbox" -> null
      - status              = "Active" -> null
    }

  # azurerm_eventhub.aria_topic["02-ap-pub"] will be destroyed
  # (because key ["02-ap-pub"] is not in for_each map)
  - resource "azurerm_eventhub" "aria_topic" {
      - id                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.EventHub/namespaces/ingest02-integration-eventHubNamespace001-sbox/eventhubs/evh-ap-pub-02-uks-dlrm-01" -> null
      - message_retention   = 1 -> null
      - name                = "evh-ap-pub-02-uks-dlrm-01" -> null
      - namespace_id        = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.EventHub/namespaces/ingest02-integration-eventHubNamespace001-sbox" -> null
      - namespace_name      = "ingest02-integration-eventHubNamespace001-sbox" -> null
      - partition_count     = 2 -> null
      - partition_ids       = [
          - "0",
          - "1",
        ] -> null
      - resource_group_name = "ingest02-main-sbox" -> null
      - status              = "Active" -> null
    }

  # azurerm_eventhub.aria_topic["02-aplfpa-ack"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-aplfpa-ack-02-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest02-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest02-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["02-aplfpa-dl"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-aplfpa-dl-02-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest02-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest02-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["02-aplfpa-pub"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-aplfpa-pub-02-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest02-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest02-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["02-aplfta-ack"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-aplfta-ack-02-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest02-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest02-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["02-aplfta-dl"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-aplfta-dl-02-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest02-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest02-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["02-aplfta-pub"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-aplfta-pub-02-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest02-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest02-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["02-apluta-ack"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-apluta-ack-02-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest02-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest02-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["02-apluta-dl"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-apluta-dl-02-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest02-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest02-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["02-apluta-pub"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-apluta-pub-02-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest02-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest02-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["02-sbl-ack"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-sbl-ack-02-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest02-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest02-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["02-sbl-dl"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-sbl-dl-02-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest02-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest02-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub.aria_topic["02-sbl-pub"] will be created
  + resource "azurerm_eventhub" "aria_topic" {
      + id                  = (known after apply)
      + message_retention   = 1
      + name                = "evh-sbl-pub-02-uks-dlrm-01"
      + namespace_id        = (known after apply)
      + namespace_name      = "ingest02-integration-eventHubNamespace001-sbox"
      + partition_count     = 2
      + partition_ids       = (known after apply)
      + resource_group_name = "ingest02-main-sbox"
      + status              = "Active"
    }

  # azurerm_eventhub_authorization_rule.aria_topic_sas["00-ap-ack"] will be destroyed
  # (because key ["00-ap-ack"] is not in for_each map)
  - resource "azurerm_eventhub_authoriza

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

azurerm_key_vault_secret.eventhub_topic_secrets["02-aplfta-ack"] will be created
  + resource "azurerm_key_vault_secret" "eventhub_topic_secrets" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.KeyVault/vaults/ingest02-meta002-sbox"
      + name                    = "evh-aplfta-ack-02-uks-dlrm-01-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.eventhub_topic_secrets["02-aplfta-dl"] will be created
  + resource "azurerm_key_vault_secret" "eventhub_topic_secrets" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.KeyVault/vaults/ingest02-meta002-sbox"
      + name                    = "evh-aplfta-dl-02-uks-dlrm-01-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.eventhub_topic_secrets["02-aplfta-pub"] will be created
  + resource "azurerm_key_vault_secret" "eventhub_topic_secrets" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.KeyVault/vaults/ingest02-meta002-sbox"
      + name                    = "evh-aplfta-pub-02-uks-dlrm-01-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.eventhub_topic_secrets["02-apluta-ack"] will be created
  + resource "azurerm_key_vault_secret" "eventhub_topic_secrets" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.KeyVault/vaults/ingest02-meta002-sbox"
      + name                    = "evh-apluta-ack-02-uks-dlrm-01-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.eventhub_topic_secrets["02-apluta-dl"] will be created
  + resource "azurerm_key_vault_secret" "eventhub_topic_secrets" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.KeyVault/vaults/ingest02-meta002-sbox"
      + name                    = "evh-apluta-dl-02-uks-dlrm-01-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.eventhub_topic_secrets["02-apluta-pub"] will be created
  + resource "azurerm_key_vault_secret" "eventhub_topic_secrets" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.KeyVault/vaults/ingest02-meta002-sbox"
      + name                    = "evh-apluta-pub-02-uks-dlrm-01-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.eventhub_topic_secrets["02-sbl-ack"] will be created
  + resource "azurerm_key_vault_secret" "eventhub_topic_secrets" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.KeyVault/vaults/ingest02-meta002-sbox"
      + name                    = "evh-sbl-ack-02-uks-dlrm-01-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.eventhub_topic_secrets["02-sbl-dl"] will be created
  + resource "azurerm_key_vault_secret" "eventhub_topic_secrets" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.KeyVault/vaults/ingest02-meta002-sbox"
      + name                    = "evh-sbl-dl-02-uks-dlrm-01-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.eventhub_topic_secrets["02-sbl-pub"] will be created
  + resource "azurerm_key_vault_secret" "eventhub_topic_secrets" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.KeyVault/vaults/ingest02-meta002-sbox"
      + name                    = "evh-sbl-pub-02-uks-dlrm-01-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_linux_function_app.example["02-af-apflpa"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-apflpa-sbox02-uks-dlrm-01"
        name                                           = "af-apflpa-sbox02-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # azurerm_linux_function_app.example["02-af-apl"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-apl-sbox02-uks-dlrm-01"
        name                                           = "af-apl-sbox02-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # azurerm_linux_function_app.example["02-af-apluta"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-apluta-sbox02-uks-dlrm-01"
        name                                           = "af-apluta-sbox02-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # azurerm_linux_function_app.example["02-af-bails"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-bails-sbox02-uks-dlrm-01"
        name                                           = "af-bails-sbox02-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # azurerm_linux_function_app.example["02-af-joh"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-joh-sbox02-uks-dlrm-01"
        name                                           = "af-joh-sbox02-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # azurerm_linux_function_app.example["02-af-sbails"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-sbails-sbox02-uks-dlrm-01"
        name                                           = "af-sbails-sbox02-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # azurerm_linux_function_app.example["02-af-td"] will be updated in-place
  ~ resource "azurerm_linux_function_app" "example" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                 = (sensitive value)
            # (9 unchanged elements hidden)
        }
        id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/sites/af-td-sbox02-uks-dlrm-01"
        name                                           = "af-td-sbox02-uks-dlrm-01"
        tags                                           = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "3000-01-01"
        }
        # (33 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # azurerm_storage_container.landing["02-html-template"] will be created
  + resource "azurerm_storage_container" "landing" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "html-template"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "ingest02landingsbox"
    }

  # azurerm_storage_container.landing["02-landing"] will be created
  + resource "azurerm_storage_container" "landing" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "landing"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "ingest02landingsbox"
    }

Plan: 74 to add, 7 to change, 18 to destroy.

Changes to Outputs:
  ~ eventhub_sas_keys = (sensitive value)
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":37,"Program":"tfcmt","SHA1":"","Target":"1112: sbox_aria - Terraform Plan Apply","Vars":{}} -->